tap "benwebber/tunnelblickctl"
tap "doctave/doctave"
tap "felixkratz/formulae"
tap "hettysoft/tap"
tap "minio/stable"
tap "nikitabobko/tap"
tap "pulumi/tap"
tap "remind101/formulae"
tap "sambadevi/powerlevel9k"
tap "tidbyt/tidbyt"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Command-line interface for SQLite
brew "sqlite"
# Java build tool
brew "ant"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# NaCl networking and cryptography library
brew "libsodium"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Generic library support script
brew "libtool"
# GNU compiler collection
brew "gcc"
# Postgres C API library
brew "libpq", link: true
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# OWASP dependency-check
brew "dependency-check"
# Command-line tool for DigitalOcean
brew "doctl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Database of public exploits and corresponding vulnerable software
brew "exploitdb"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# File harvester to ship log files to Elasticsearch or Logstash
brew "filebeat"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Next-gen compiler infrastructure
brew "llvm@17"
# Rainbows and unicorns in your console!
brew "lolcat"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk@11"
# Tools and libraries for smart cards
brew "opensc"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Enhanced, multi-threaded syslogd
brew "rsyslog", restart_service: :changed
# Safe, concurrent, practical language
brew "rust"
# Microsoft SQL Server command-line interface
brew "sqlcmd"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Tool to impose load on and stress test a computer system
brew "stress"
# Version control system designed to be a better CVS
brew "subversion"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# NetBSD's FTP client
brew "tnftp"
# Anonymizing overlay network for TCP
brew "tor", restart_service: :changed
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Virtual PC simulator for testing IP routing
brew "vpcs"
# PDF viewer
brew "xpdf"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Command-line interface for Tunnelblick
brew "benwebber/tunnelblickctl/tunnelblickctl"
# Opinionated developer documentation site generator
brew "doctave/doctave/doctave"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# An HTTP toolkit for security research.
brew "hettysoft/tap/hetty"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Pulumi ESC - Manage Environments, Secrets, and Configuration
brew "pulumi/tap/esc"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Easily assume AWS roles in your terminal
brew "remind101/formulae/assume-role"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# App runtime and UX toolkit for pixel-based apps.
brew "tidbyt/tidbyt/pixlet"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Multi-track audio editor and recorder
cask "audacity"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Utility to create and modify archives
cask "betterzip"
# Web security testing toolkit
cask "burp-suite-professional"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# Disk usage utility
cask "disk-inventory-x"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Screen colour temperature controller
cask "flux-app"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Free and open-source image editor
cask "gimp"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Retro video game emulation
cask "openemu"
# WebKit based web browser
cask "orion"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# .NET IDE
cask "rider"
# Music streaming service
cask "spotify"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# General-purpose text editor
cask "textmate"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Virtualiser for arm64 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Free and open source web app scanner
cask "zap"
# Desktop client for the Zulip team chat platform
cask "zulip"
mas "1Password for Safari", id: 1569813296
mas "Banktivity", id: 1480779512
mas "Bear", id: 1091189122
mas "BetterSnapTool", id: 417375580
mas "DigiDoc4", id: 1370791134
mas "GSE SMART IPTV LITE", id: 1293450217
mas "HP", id: 1474276998
mas "HP Easy Scan", id: 967004861
mas "iMovie", id: 408981434
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SerialTools", id: 611021963
mas "Slack", id: 803453959
mas "VMware Remote Console", id: 1230249825
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Yubico Authenticator", id: 1497506650
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "aws-scripting-guy.cform"
vscode "bierner.markdown-mermaid"
vscode "blinkshellinc.blink-fs"
vscode "bruno-api-client.bruno"
vscode "codemooseus.vscode-devtools-for-chrome"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "gabrielgomesfernandes.classicasp-html-snippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "hossaini.bootstrap-intellisense"
vscode "ilich8086.classic-asp"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ivankarpinskiy.bookmarks"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "johnpapa.vscode-peacock"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "nrwl.angular-console"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "pulumi.pulumi-lsp-client"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "steoates.autoimport"
vscode "tomrijndorp.find-it-faster"
vscode "unifiedjs.vscode-mdx"
vscode "uniquevision.vscode-plpgsql-lsp"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zbecknell.asp-classic-support"
